presentation/Notes.tex
% Created 2021-12-15 mer 16:57
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[latin1]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\section{presentation}
\label{sec:org82e75c1}
\subsection{Good moring everyone}
\label{sec:orga485dc0}
I'm luca and I'm here t talk to you about an innovation at Meta.
First of all, what is meta? Meta Platforms Inc., also referred to
in this paper as Meta and formerly known as Facebook Inc., is an
American transnational holding company, which owns a technological
conglomerate, based in Menlo Park, California. It is a parent
organization of Facebook, Instagram, WhatsApp and Oculus. Being one
of the most valuable companies in the world, it is also one of the
Big Tech companies in U.S. information technology, alongside
Amazon, Google, Apple and Microsoft.
\subsection{What im going to talk about}
\label{sec:orgfd0cf45}
is first of all Meta business model. We'll introduce it and we'll
se what are the core aspects of it, and how Hate speech might be a
problem.

Secondly, we'll talk about what Meta is doing to contrast HS and
the specific case of a new AI model they developed and why they
developed it.

Finally, we'll see how this innovation in AI they are carrying out
interacts with their business model, and how it can bring new value
to it.
\subsection{Ok, we've talked about Meta's business model}
\label{sec:orgded7882}
What I'll present to you however is not the complete business
model. The report I wrote focused on Meta's social media platforms,
since they are the primary source of revenues for meta, and left
out other secondary products, like for example oculus and novi,
wich are still in their experimental phase. So from now on we'll
concentrate on these two products of Meta: Facebook and Instagram,
the two famous social media platforms.
\subsection{Here's an elaboration of the nusiness model of these two platforms.}
\label{sec:orgea3d2a0}
Unfortinately during this research I found no articles going in
depth of the business model fo Meta, so I had to relay on the
specialized press for it. Luckly, most of the articles seemd to
agree on what was the core structure of Meta's business on social
platforms.

\begin{description}
\item[{key partners}] are mostly content creators (individuals or
firms) and ad agencies, meta works with them to assure constant
new content inside of the platforms and acquire data on
demographics.
\item[{key activities}] are mainly the development and mantainance of
its platforms and of new products (R\&D)
\item[{key resources}] are bothe the platforms themselves, AND the
social graph thwy bilt in these years, that is to say the series
of connections between one person and its friends and
relatives. This is paart of what the information business is
about.
\item[{channels}] are the mobile and web applications that the
companies develop and mantain.
\item[{customers relationships}] widh same side we mean that they are
based on the platforms themselves, primarely for the users, but
more and more also for the advertisers. With cross side, instead,
we mean that some relationships go trough an international sales
organization, for this reason cross side (perpendicular to the
platforms).
\item[{customers}] there are three main categories of customers
integrated in Meta's business model: internet users (users),
advertisers and developers. Each of them generates an highlighted
revenue stream:
\item[{revenue streams}] \begin{description}
\item[{free}] for the users
\item[{ad revenues}] are the revenues that the advertisers ay to let
users see their ads (obv)
\item[{payment revenues}] happen when users pay for some features
inside of something developed with meta's development platform.
\end{description}
\end{description}

What should come out from this model is that users, customers, are
also a resource for Meta, since the value they propose to
advertisers is the presence of users themselves on their patform,
and therefore an install base to show teir products.
\subsection{Therefore}
\label{sec:orgf0dc75c}
The relationship between the company and the customers is a key
component in meta business model, along with factors that keep the
users \emph{inside} of Meta's platforms. Factors, instead, that create a
sense of distrust between the company and the customers puts the
system in dange in a way, becaus, if we look again at the business
model, if the users leave the platform one of the value
propositions goes away, and this means less revenue for the company.
\subsection{What are these factors?}
\label{sec:org95319de}
One is for sure hate speech. Even though in the short term this
might seem profitable, since it engases the users, on the long run
becomes a problem, since because of the toxic environment it
creates both users and investors are incentivized to leave the
platform. in fact users dont want to spend their time arguing with
other people and investors dont want their products associated to
controversial topics that might hurt their image.
\subsection{What to do then?}
\label{sec:orgcb90810}
Meta started a journey in 2016, it aimed to build efficent and
trustful AI models that could predict weather a content was or not
harmful. this way they would be able to remove suh content from
their platforms. Since then more and more sophisticated models have
emerged from Meta's AI research groups, and in the last years the
results became more and more reliable. One problem though that they
kept facing was that content, since is a human product of language
and culture, evolves \textbf{very} rapidly, and up now the systems they
used could intercept such changes in a metter of months.
\subsection{A new fast shot learner is a step in the right direction}
\label{sec:org7e61483}
A recent new approach came out to Meta AI R\&D, a new few shot
learner ould help in this case, since is able to learn form a
smaller set of data, and therefore \emph{learn} in less time
\subsection{Once they put this in production}
\label{sec:orgaff0f19}
the results begin to be seen: form 10 violent content each 10000
seen by the users, the company was able to lower this number to 3
each 10000, wich is an increment of circa 3 times on the efficency
of the model.
\subsection{This however is not a radical innovation}
\label{sec:orgddd3cc1}
Is not something nobody has ever seen, but it surely is an
incremental innovation since builds upon other results from
academia and the same company.

Ok, but how does this affects the company business model?
\subsection{Certainly}
\label{sec:org2d6c9e9}
Since we saw that harmful content could be a problem in the
original model, we can already see that is tacles users and
advertisers. What we argue is that it also adds a value to the
business model, since a system like that incentivises the creation
of an helathy and peaceful environment for users and assures
advertisers not to be associated with harmful content!
\subsection{THanks for the attention}
\label{sec:orgf61ef4f}
here there are the references
\end{document}